Revit 2027 API
RebarBarType.GetStaggerLength Method
 Gets the stagger length taking into account the specified Rebar Splice Type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetStaggerLength(
	ElementId rebarSpliceTypeId
)
Public Function GetStaggerLength (
	rebarSpliceTypeId As ElementId
) As Double
public:
double GetStaggerLength(
	ElementId^ rebarSpliceTypeId
)
member GetStaggerLength :
        rebarSpliceTypeId : ElementId -> float
Parameters
rebarSpliceTypeId ElementId
 The Rebar Splice Type id. Interactions with Rebar Splice Types can be done with the functions in RebarSpliceTypeUtils.
Return Value
Double
 Returns the stagger length.
Exceptions
Exception | Condition
ArgumentException |  The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace